title: DNS Exfiltration
id: 1a2b3c4d-5e6f-7a8b-9c0d-1e2f3a4b5c6d
status: experimental
logsource:
  category: dns
detection:
  selection:
    query|endswith: '.xyz'
  condition: selection
level: medium
